compenguy/tempy/sdkconfig.defaults.esp32h2
CONFIG_IDF_TARGET="esp32h2"

# Enable BLE sleep
CONFIG_BT_LE_SLEEP_ENABLE=y
CONFIG_BT_LE_LP_CLK_SRC_MAIN_XTAL=y
# RTC clock source is a Kconfig choice; the H2's default is
# RTC_CLK_SRC_INT_RC (internal 136 kHz RC), which is what we want when the
# module has no external 32 kHz crystal. Set another RTC_CLK_SRC_* to y
# here only if you need a different source.

# Power Management
CONFIG_ESP_SLEEP_POWER_DOWN_FLASH=y
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y
# Keep peripherals biased through light sleep. Turning this on saves
# a bit of average current, but on the H2 the I2C master driver's
# .allow_pd = true state-restore is unreliable: after wake, the very
# next BME280 transaction times out, the sensor task never seeds the
# Matter attribute, and reads come back as null. With this off, light
# sleep still saves the CPU + RF power for ~99% of each 60 s cycle,
# and only the peripheral bias current is retained -- a few tens of
# µA on H2. Well worth it for reliable I2C.
CONFIG_PM_POWER_DOWN_PERIPHERAL_IN_LIGHT_SLEEP=n
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_48=y
# Hold a NO_LIGHT_SLEEP PM lock automatically whenever the USB Serial
# JTAG port is enumerated. H2's USJ block doesn't survive light sleep
# (SOC_USB_SERIAL_JTAG_SUPPORT_LIGHT_SLEEP is a TODO in the SoC caps),
# so without this, plugging in a cable while light sleep is enabled
# kills the monitor on the first sleep entry and makes debugging
# impossible. Zero cost when the cable is unplugged.
CONFIG_USJ_NO_AUTO_LS_ON_CONNECTION=y

# FreeRTOS config for light sleep
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# IEEE802.15.4 sleep
CONFIG_IEEE802154_SLEEP_ENABLE=y

# Enable OpenThread
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
CONFIG_OPENTHREAD_LOG_LEVEL_NOTE=y
CONFIG_OPENTHREAD_CLI=n
CONFIG_OPENTHREAD_MTD=y

# mbedTLS
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y

# LwIP config for OpenThread for light sleep
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_MULTICAST_PING=n
CONFIG_LWIP_IPV4=n
CONFIG_LWIP_ND6=n
CONFIG_DISABLE_IPV4=y

# DNS-SD backend for Matter: use the OpenThread platform mDNS/SRP
# implementation, not CHIP's own minimal mDNS. On a Thread-only
# device, minimal mDNS can't send its advertisements onto the mesh
# reliably -- Advertiser_ImplMinimalMdns::Respond() ends up bouncing
# with LwIP ERR_RTE / CHIP_ERROR_INVALID_ADDRESS, no operational
# record ever propagates to the OTBR, chip-tool's discovery times
# out, and commissioning fails at the CASE step. With this off,
# ChipDnssdPublishService routes through OpenThreadDnssdImpl and
# calls otSrpClientAddService, which is what actually lands the
# _matter._tcp record on the OTBR's SRP server for LAN bridging.
CONFIG_USE_MINIMAL_MDNS=n

# CHIP-over-BLE advertising intervals (units of 0.625 ms).
# Matter's spec-recommended default is 25 ms fast for the first 30 s,
# then 500 ms slow for the remainder of the commissioning window.
# BlueZ / snap chip-tool tends to time out on Connect() during the
# 500 ms slow phase -- BlueZ's Device.Connect() has a hard 20 s ceiling
# and slow-advertising connection procedures don't always fit. Halve
# the slow interval so connections stay reliable if the human takes
# more than 30 s to fire the pairing command. The extra power is
# negligible for a LIT ICD because BLE is only on during commissioning
# windows (max 15 min).
CONFIG_BLE_SLOW_ADVERTISING_INTERVAL_MIN=160
CONFIG_BLE_SLOW_ADVERTISING_INTERVAL_MAX=160

# Disable STA for ESP32H2
CONFIG_ENABLE_WIFI_STATION=n

# Matter configuration
CONFIG_ENABLE_OTA_REQUESTOR=n
CONFIG_ENABLE_EXTENDED_DISCOVERY=y

# ICD configuration
CONFIG_ENABLE_ICD_SERVER=y

# Slow poll: How often device checks Thread network when idle.
# Increased to 60s to match sensor reading interval - major power savings.
CONFIG_ICD_SLOW_POLL_INTERVAL_MS=60000

# Fast poll: How often device polls when active (commissioning, recent activity).
# 200ms provides responsive commissioning without excessive polling.
CONFIG_ICD_FAST_POLL_INTERVAL_MS=200

# Idle mode interval: Time before transitioning from active to idle mode.
# Device stays idle for 3600 seconds (one hour)
CONFIG_ICD_IDLE_MODE_INTERVAL_SEC=3600

# Active mode interval: How long device stays awake after sending a message.
# Reduced to 500ms - enough for response, then back to sleep.
CONFIG_ICD_ACTIVE_MODE_INTERVAL_MS=500

# Active mode threshold: Minimum active time when woken by external event.
# Only required when a check-in client is registered
# LIT spec requires >= 5000ms
CONFIG_ICD_ACTIVE_MODE_THRESHOLD_MS=5000

# LIT (Long Idle Time) ICD - enables deep idle states
CONFIG_ENABLE_ICD_LIT=y

# Subscription limits - 2 is sufficient for most home automation setups
CONFIG_ICD_CLIENTS_SUPPORTED_PER_FABRIC=2
CONFIG_ICD_MAX_NOTIFICATION_SUBSCRIBERS=2

# Button power-save is now a runtime option
# (button_gpio_config_t::enable_power_save) rather than a Kconfig
# symbol in the current espressif__button component. The app enables
# it in factory_reset_button_register() by calling
# iot_button_new_gpio_device() directly (bsp_iot_button_create()
# doesn't expose the flag).

# ESP32-H2-DevKitM-1 Settings
# Buttons
CONFIG_BSP_BUTTONS_NUM=1
CONFIG_BSP_BUTTON_1_TYPE_GPIO=y
CONFIG_BSP_BUTTON_1_GPIO=9
CONFIG_BSP_BUTTON_1_LEVEL=0

# Hardware revision of the H2-based Tempy PCB. Bump on physical board
# changes (new pinout, different sensor, etc.), not on firmware changes.
CONFIG_DEFAULT_DEVICE_HARDWARE_VERSION=1
